Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
apply)
      + name           = "/marketplace/stage/sqs/intelligence-option-analysis-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.intelligence_orchestration_queue_url will be created
+ resource "aws_ssm_parameter" "intelligence_orchestration_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/stage/sqs/intelligence-orchestration-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.outbound_sync_dlq_url will be created
+ resource "aws_ssm_parameter" "outbound_sync_dlq_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/stage/sqs/outbound-sync-dlq-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.outbound_sync_queue_arn will be created
+ resource "aws_ssm_parameter" "outbound_sync_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/stage/sqs/outbound-sync-queue-arn"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.outbound_sync_queue_url will be created
+ resource "aws_ssm_parameter" "outbound_sync_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/stage/sqs/outbound-sync-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.qna_outbox_dlq_url will be created
+ resource "aws_ssm_parameter" "qna_outbox_dlq_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/stage/sqs/qna-outbox-dlq-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.qna_outbox_queue_arn will be created
+ resource "aws_ssm_parameter" "qna_outbox_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/stage/sqs/qna-outbox-queue-arn"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.qna_outbox_queue_url will be created
+ resource "aws_ssm_parameter" "qna_outbox_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/stage/sqs/qna-outbox-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.refund_outbox_queue_arn will be created
+ resource "aws_ssm_parameter" "refund_outbox_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/stage/sqs/refund-outbox-queue-arn"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.refund_outbox_queue_url will be created
+ resource "aws_ssm_parameter" "refund_outbox_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/stage/sqs/refund-outbox-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.shipment_outbox_dlq_url will be created
+ resource "aws_ssm_parameter" "shipment_outbox_dlq_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/stage/sqs/shipment-outbox-dlq-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.shipment_outbox_queue_arn will be created
+ resource "aws_ssm_parameter" "shipment_outbox_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/stage/sqs/shipment-outbox-queue-arn"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.shipment_outbox_queue_url will be created
+ resource "aws_ssm_parameter" "shipment_outbox_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/stage/sqs/shipment-outbox-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.sqs_access_policy_arn will be created
+ resource "aws_ssm_parameter" "sqs_access_policy_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/stage/sqs/access-policy-arn"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 30 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-sqs-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fstage%252Fsqs%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-sqs-stage
  ```
Plan: 30 to add, 0 to change, 0 to destroy.

---
### 6. project: `marketplace-ecs-worker-stage` dir: `terraform/environments/stage/ecs-worker` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/marketplace-cluster-stage/marketplace-worker-stage"
        name                               = "marketplace-worker-stage"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for marketplace-worker-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "marketplace-worker-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "marketplace"
            "Service"     = "marketplace-worker"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-stage:433" -> "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/marketplace-worker-stage:434"
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.worker_task_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::646886795421:policy/marketplace-sqs-access-prod"] will be created
+ resource "aws_iam_role_policy_attachment" "aws-managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::646886795421:policy/marketplace-sqs-access-prod"
      + role       = "marketplace-worker-task-role-stage"
    }

  # module.worker_task_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::646886795421:policy/marketplace-sqs-access-stage"] will be destroyed
  # (because key ["arn:aws:iam::646886795421:policy/marketplace-sqs-access-stage"] is not in for_each map)
- resource "aws_iam_role_policy_attachment" "aws-managed" {
      - id         = "marketplace-worker-task-role-stage-20260310071142938500000001" -> null
      - policy_arn = "arn:aws:iam::646886795421:policy/marketplace-sqs-access-stage" -> null
      - role       = "marketplace-worker-task-role-stage" -> null
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-ecs-worker-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fstage%252Fecs-worker%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-ecs-worker-stage
  ```
Plan: 1 to add, 1 to change, 1 to destroy.

---
### Plan Summary

6 projects, 5 with changes, 1 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```